[
  {
    "id": 1,
    "title": "Fake News Analysis using Machine Learning Algorithms",
    "description": "Trained different types of models – KNN, Decision Tree, Random Forest, Gradient Boosting and Passive Aggression algorithm on a balanced class dataset and achieved highest accuracy of 94.47%. Performed preprocessing, data cleaning and training of model which has 50.1% of Real and 49.9% of Fake news article in data.",
    "category": "Python",
    "githubLink": "https://github.com/dhruvpatel1205/FakeNewsAnalysis"
  },
  {
    "id": 2,
    "title": "Performance Evaluation of 5Greplay on 5G network",
    "description": "Pioneered 5G security research by executing a replay attack with help of fuzzers, enhancing software verification. Collected and utilized pcap files via Wireshark on a live 5G network system.Conducted rigorous test on multiple fuzzers on open5GS and Free5GC, ensuring system against unexpected inputs.",
    "category": "MS Project, 5G Security",
    "githubLink": "https://github.com/Montimage/5GReplay/releases"
  },
  {
    "id": 3,
    "title": "Tarot- Weaving Stories",
    "description": "Created an interactive storytelling using Flask, enhancing user engagement with tarot-based narratives. Generated accurate fortune-telling results from a JSON Schema, achieving 80% similarity to the original paper. Introduced features to draw 1 or 3 tarot cards for personalized and humorous readings, improving user experience.",
    "category": "Python, Flask",
    "githubLink": "https://github.com/dhruvpatel1205/Tarot-Weaving-Stories/"
  },
  {
    "id": 4,
    "title": "JavaFeast: order management application",
    "description": "Designed Java applications for dining management, order handling, and generating receipts. Simplified deployment process Hibernate ORM and Apache Tomcat with Postgres in MVC model. Efficiently manipulated complex data schemas using DML statements for data addition, update & deletion. Achieved 95% accuracy in CRUD operation through the implementation of Java Persistence API (JPA) mechanism. Implemented JUNIT test cases covering approximately 30% of the code.",
    "category": "Java, Hibernate",
    "githubLink": "https://github.com/dhruvpatel1205/JavaFeast-Order-Management-Application"
  },
  {
    "id": 5,
    "title": "Investigation tool using regex",
    "description": "Developed a tool in Python to mitigate active DOS attacks using Regular Expression (regex). Optimized project deliverables by refining data models, improving accuracy and efficiency. Utilized Socket Programming API for tracking incoming packets, monitoring network traffic at a 95% success rate.",
    "category": "Python",
    "githubLink": "https://github.com/yourusername/project2"
  }
]
